package Problem_List.Q650_2_Keys_Keyboard;
/*
Ідея рішення
Починаємо з одного символу 'A'.

Щоб отримати рівно n символів, оптимальна стратегія — розкласти n на множники.

Кожен множник відповідає циклу операцій:

Copy All (1 операція)

Paste (множник - 1 разів)

Тобто для множника k потрібно k операцій, щоб збільшити кількість символів у k разів.

👉 Мінімальна кількість операцій = сума простих множників числа n.
 */

class Solution {
	public int minSteps(int n) {
		int res = 0;
		int d = 2;
		
		while (n > 1) {
			while (n % d == 0) {
				res += d;
				n /= d;
			}
			d++;
		}
		
		return res;
	}
}
